web_task_2/ab_django.log
This is ApacheBench, Version 2.3 <$Revision: 1706008 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)


Server Software:        gunicorn/19.7.1
Server Hostname:        127.0.0.1
Server Port:            8081

Document Path:          /hello_world/
Document Length:        17 bytes

Concurrency Level:      10
Time taken for tests:   5.815 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      186000 bytes
HTML transferred:       17000 bytes
Requests per second:    188.98 [#/sec] (mean)
Time per request:       53.146 [ms] (mean)
Time per request:       5.315 [ms] (mean, across all concurrent requests)
Transfer rate:          31.24 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.1      0       3
Processing:    46   58  16.8     50     151
Waiting:       45   57  16.5     49     151
Total:         46   58  16.9     50     152

Percentage of the requests served within a certain time (ms)
  50%     50
  66%     53
  75%     59
  80%     64
  90%     79
  95%     93
  98%    118
  99%    137
 100%    152 (longest request)