web_task_2/ab_django.log
This is ApacheBench, Version 2.3 <$Revision: 1706008 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)


Server Software:        gunicorn/19.7.1
Server Hostname:        127.0.0.1
Server Port:            8081

Document Path:          /hello_world/
Document Length:        17 bytes

Concurrency Level:      10
Time taken for tests:   5.331 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      186000 bytes
HTML transferred:       17000 bytes
Requests per second:    187.58 [#/sec] (mean)
Time per request:       53.310 [ms] (mean)
Time per request:       5.331 [ms] (mean, across all concurrent requests)
Transfer rate:          34.07 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.8      0       8
Processing:     8   53   9.7     49      99
Waiting:        0   52   9.7     48      98
Total:         15   53   9.7     49      99

Percentage of the requests served within a certain time (ms)
  50%     49
  66%     51
  75%     54
  80%     55
  90%     71
  95%     76
  98%     79
  99%     85
 100%     99 (longest request)