web_task_2/ab_nginx.log
This is ApacheBench, Version 2.3 <$Revision: 1706008 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)


Server Software:        nginx/1.10.0
Server Hostname:        127.0.0.1
Server Port:            80

Document Path:          /hello_world/
Document Length:        17 bytes

Concurrency Level:      10
Time taken for tests:   1.171 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      192000 bytes
HTML transferred:       17000 bytes
Requests per second:    854.05 [#/sec] (mean)
Time per request:       11.709 [ms] (mean)
Time per request:       1.171 [ms] (mean, across all concurrent requests)
Transfer rate:          160.13 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    2   3.5      1      23
Processing:     1    9   4.5      9      25
Waiting:        0    7   4.4      7      24
Total:          3   11   4.8     11      32

Percentage of the requests served within a certain time (ms)
  50%     11
  66%     12
  75%     14
  80%     15
  90%     18
  95%     20
  98%     23
  99%     26
 100%     32 (longest request)