web_task_2/ab_nginx.log
This is ApacheBench, Version 2.3 <$Revision: 1706008 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)


Server Software:        nginx/1.10.0
Server Hostname:        127.0.0.1
Server Port:            80

Document Path:          /hello_world/
Document Length:        17 bytes

Concurrency Level:      10
Time taken for tests:   0.612 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      192000 bytes
HTML transferred:       17000 bytes
Requests per second:    1632.88 [#/sec] (mean)
Time per request:       6.124 [ms] (mean)
Time per request:       0.612 [ms] (mean, across all concurrent requests)
Transfer rate:          306.16 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    2   2.6      1      22
Processing:     0    4   4.6      3      26
Waiting:        0    3   3.6      2      25
Total:          3    6   4.9      4      27

Percentage of the requests served within a certain time (ms)
  50%      4
  66%      4
  75%      6
  80%      8
  90%     12
  95%     19
  98%     23
  99%     27
 100%     27 (longest request)