web_task_2/ab_wsgi.log
This is ApacheBench, Version 2.3 <$Revision: 1706008 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)


Server Software:        gunicorn/19.7.1
Server Hostname:        127.0.0.1
Server Port:            8081

Document Path:          /
Document Length:        34 bytes

Concurrency Level:      10
Time taken for tests:   2.517 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      180000 bytes
HTML transferred:       34000 bytes
Requests per second:    397.27 [#/sec] (mean)
Time per request:       25.172 [ms] (mean)
Time per request:       2.517 [ms] (mean, across all concurrent requests)
Transfer rate:          69.83 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.4      0       4
Processing:     4   25   6.6     22      49
Waiting:        0   24   6.4     21      48
Total:          6   25   6.6     22      50

Percentage of the requests served within a certain time (ms)
  50%     22
  66%     23
  75%     26
  80%     28
  90%     37
  95%     42
  98%     43
  99%     44
 100%     50 (longest request)