web_task_2/ab_wsgi.log
This is ApacheBench, Version 2.3 <$Revision: 1706008 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)


Server Software:        gunicorn/19.7.1
Server Hostname:        127.0.0.1
Server Port:            8081

Document Path:          /
Document Length:        34 bytes

Concurrency Level:      10
Time taken for tests:   2.605 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      180000 bytes
HTML transferred:       34000 bytes
Requests per second:    398.82 [#/sec] (mean)
Time per request:       25.054 [ms] (mean)
Time per request:       2.155 [ms] (mean, across all concurrent requests)
Transfer rate:          67.47 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.4      0       4
Processing:     7   26   9.1     22      73
Waiting:        7   25   8.8     22      70
Total:         11   26   9.1     22      74

Percentage of the requests served within a certain time (ms)
  50%     22
  66%     24
  75%     26
  80%     32
  90%     40
  95%     47
  98%     53
  99%     61
 100%     74 (longest request)